vicliu624/trail-mate/builds/esp_idf/targets/tlora_pager/sdkconfig.defaults
# Minimal ESP-IDF compile baseline derived from boards/lilygo-t-lora-pager.json.
# Hardware-specific PSRAM/display/NFC validation remains pending.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
